{"error":"OK","limit":1,"offset":0,"number_of_page_results":1,"number_of_total_results":1,"status_code":1,"results":{"api_detail_url":"http:\/\/www.giantbomb.com\/api\/review\/1900-45\/","deck":"Too Human has a unique setting and some compelling ideas, but it doesn't offer enough variety to stay fresh from start to finish.","description":"<div>Do you like loot? Then Too Human might be for you. If you have an insatiable lust for items with higher stats than the ones you're currently using, or if you get giddy at the mere thought of Diablo-style rare item naming conventions, you'll probably be able to look past the game's issues and have a good time. But even at its best, it's hard to ignore Too Human's monotonous combat and dated approach to cooperative play.<\/div><br\/><div><figure data-align=\"right\" data-embed-type=\"image\" data-img-src=\"http:\/\/static.giantbomb.com\/uploads\/original\/0\/2822\/347016-toohuman_wp3_1680.jpg\" data-ref-id=\"1300-347016\" data-size=\"medium\" data-ratio=\"0.625\" data-width=\"480\" style=\"width: 480px\"><a class=\"fluid-height\" style=\"padding-bottom:62.5%\" href=\"http:\/\/static.giantbomb.com\/uploads\/original\/0\/2822\/347016-toohuman_wp3_1680.jpg\" data-ref-id=\"1300-347016\"><img src=\"http:\/\/static.giantbomb.com\/uploads\/scale_medium\/0\/2822\/347016-toohuman_wp3_1680.jpg\" alt=\"You play as Lord Baldur.\"><\/a><figcaption>You play as Lord Baldur.<\/figcaption><\/figure>At least the setting is unique. The game is rooted in Norse mythology, yet it takes place in a futuristic sci-fi setting. So there are a bunch of cyber-Vikings running around. Rather than focusing on magic or sorcery, the game trades in cybernetic implants and cyberspace. You play as Baldur, one of Odin's sons. You're delivered right into the action at the beginning of the game, and flashbacks pepper the game's first area in an attempt to fill you in. They aren't terribly effective, though, as there's very little in place to set up the world itself, why it's being invaded by robots, and who is ultimately responsible. As it's a Norse tale, it doesn't take long before figures such as Thor, Heimdall, and Loki appear, and as it's tapping into the whole Viking thing, there are plenty of moments where important things like \"Valhalla\" and \"mead\" are discussed. It clashes with the game's sci-fi look here and there, but even though the events of the game are quite convoluted, it's still an interesting combination.<\/div><br\/><div>The game itself combines inspirations from a handful of different sources, as well. Too Human is an action RPG with similarities to Diablo. You'll run through combat areas, fighting off hordes of robots or zombies, hacking and slashing all the while. You'll collect scads of loot with different status effects and statistical bonuses and attempt to collect full sets of armor for an even greater protective bonus. The game's four worlds and overall structure, however, have more of a Phantasy Star Online feel to them. Each area has enemies that do a different type of damage, allowing you to prep a different set of armor for each area, if you wish. Also, like PSO, it seems to be the intent of the developers that you grind through each area multiple times in a quest for better gear. A straight single-player run through the game took me around 12 hours and left me at level 29. The maximum level, however, is 50. Lastly, the game's combat system attempts to bring in air combos, juggles, and a mixture of swords and firearms that gives it a few check marks in the Devil May Cry column.<\/div><br\/><div>That doesn't really mean that if you're a fan of all of Too Human's inspirations that you'll automatically love this, though. Despite attempts to work in some advanced combat options, the action in Too Human feels quite thin. There's a real lack of enemy variety, and your best viable option quickly becomes \"shoot the enemies until they get close, switch to melee and start popping them up in the air with your attacks, then jump up after them to finish the job with an air combo.\" Regardless of the class you select, the same tactics still apply. The classes put focuses on different aspects of your character and give you a different skill tree to fill out as you gain levels. But other than the offense-focused berserker class feeling a little fragile when playing alone and the bio engineer's latent automatic healing ability, you're looking at basic shades of offensive or defensive specialization.<\/div><br\/><div><figure data-align=\"left\" data-embed-type=\"image\" data-img-src=\"http:\/\/static.giantbomb.com\/uploads\/original\/0\/26\/11799-shot_0028625.jpg\" data-ref-id=\"1300-11799\" data-size=\"medium\" data-ratio=\"0.5625\" data-width=\"480\" style=\"width: 480px\"><a class=\"fluid-height\" style=\"padding-bottom:56.3%\" href=\"http:\/\/static.giantbomb.com\/uploads\/original\/0\/26\/11799-shot_0028625.jpg\" data-ref-id=\"1300-11799\"><img src=\"http:\/\/static.giantbomb.com\/uploads\/scale_medium\/0\/26\/11799-shot_0028625.jpg\" alt=\"The streets of Too Human are paved with loot.\"><\/a><figcaption>The streets of Too Human are paved with loot.<\/figcaption><\/figure>There's a lot of customization that can be done to both your character and your gear. First, there's the skill tree, which is different for every class. There's also a secondary skill tree that opens up later on. You can slot weapons and armor all over your character, and the game does a good job of making a lot of the wearables look different, so it's likely that no two Baldurs will look identical. Also, the weapons and armor come in different forms. So you might find a sword that has \"of rooting\" on the end, which has a special ability that makes your targets immobile when it activates. You may also find weapons with empty rune slots on them. You'll find runes along the way with different bonuses, such as Total Armor +5% or Soothing +10% and so on. Fitting these runes into slots on your weapons and armor lets you further beef up any area where you feel like you're lacking, but as a rule, adding to your total armor never seems to be a bad idea.<\/div><br\/><div>Runes also come into play with charms. Charms are items that you often find in cyberspace, and they act as little miniquests when equipped. Each charm will have a task that must be completed, such as \"collect 10 blueprints\" or \"kill 200 undead.\" When you complete that task and feed the charm a specific set of runes, it activates and gives you a listed bonus, like a chance for your attacks to put enemies to sleep or the chance to add lightning to your strikes at random, and so on. While this ensures that you'll almost always have something to work on completing, even after you've finished the game numerous times, most of the charms aren't interesting enough to make repeated trips into the game's four areas much more entertaining. Also, the creatures scale up in level just as you do, so the level of challenge doesn't change much over the course of the game.<\/div><br\/><div>The thing that's supposed to keep you coming back is the game's online cooperative play, which lets another player join you over Xbox Live. Players can trade items when connected and combining players from different classes can mix things up a little bit. For example, the bio engineer's healing abilities offset the berserker's utter lack of defense to some degree. While it may be tempting to jump right into co-op and forget that the single-player campaign even exists, you should know that none of the game's story is present when playing online. Also, all friendly AI-controlled characters don't appear at all. So you won't be fighting alongside chattery humans and you won't see them wandering around the game's town area having random conversations, either. No cutscenes, just raw combat. Considering that the game's story isn't so hot to begin with, maybe this is a decent trade-off, but this mostly makes the game feel dated--most modern story-driven co-op games have found a way to integrate some portion of the story into multiplayer play.<\/div><br\/><div><figure data-align=\"right\" data-embed-type=\"image\" data-img-src=\"http:\/\/static.giantbomb.com\/uploads\/original\/0\/3111\/206306-human.jpg\" data-ref-id=\"1300-206306\" data-size=\"medium\" data-ratio=\"0.59065420560748\" data-width=\"480\" style=\"width: 480px\"><a class=\"fluid-height\" style=\"padding-bottom:59.1%\" href=\"http:\/\/static.giantbomb.com\/uploads\/original\/0\/3111\/206306-human.jpg\" data-ref-id=\"1300-206306\"><img src=\"data:image\/gif;base64,R0lGODlhAQABAAAAACH5BAEKAAEALAAAAAABAAEAAAICTAEAOw==\" alt=\"Baldur likes to stay a'head' of the competition. Sorry.\" class=\"js-lazy-load-image\" data-src=\"http:\/\/static.giantbomb.com\/uploads\/scale_medium\/0\/3111\/206306-human.jpg\"><noscript><img src=\"http:\/\/static.giantbomb.com\/uploads\/scale_medium\/0\/3111\/206306-human.jpg\" alt=\"Baldur likes to stay a'head' of the competition. Sorry.\"><\/noscript><\/a><figcaption>Baldur likes to stay a'head' of the competition. Sorry.<\/figcaption><\/figure>Too Human makes its four different combat areas look appropriately different, and things like up-close shots of the character models look just fine. But in action, the combat itself looks sort of bad. The game's animation feels completely canned, and there are plenty of cases where you're watching your weapons flail around, waiting for an animation to finish so you can get back in control. Little things, like the way the valkyries' legs clip through the ground when they come down to carry away dead players, or the way two-handed swords aren't actually attached to the player model when stored on your character's back make the whole game feel rough. The way the characters slide around to attack faraway targets also looks strange, as does the way air attacks let you hang in the air for a few seconds and repeatedly swing your weapon or execute a finisher, though there are at least gameplay reasons for those instances.<\/div><br\/><div>Too Human has a real lack of enemy variety, and the first three areas of the game pit you against what seems like two types of robots, a couple types of larger robots, and perhaps some robots that are colored a bit differently to denote a special ability. On top of all that, the game's frame rate gets unstable in spots. Too Human has its moments of visual splendor, but they're few and far between. The game uses dynamic music that picks up when combat starts and quickly fades away when there's nothing actively coming at you. But the moments of non-combat are very brief, resulting in dynamic music that always seems to be starting or stopping. When you get to hear more than eight bars of it in a row, the game's music is fine.<\/div><br\/><div>As the first part of a planned trilogy, Too Human doesn't do a particularly good job of setting things up. If anything meaningful happens in this game aside from establishing a villain, it was lost on me. The only way I got anything interesting out of it was to start searching for web pages devoted to Baldur's place in Norse mythology to see how many liberties Silicon Knights is taking with its fiction and to see what sorts of things could lie ahead in the next games. As a game, the action is a little too straightforward for its own good. The latent loot fiend in me had fun uncovering new items, slotting runes, and finding blueprints for new items--but even that stuff doesn't feel as fleshed out as you'd probably expect. In short, large parts of Too Human feel like they were designed to the standards of the last generation of consoles, not this one.<\/div>","dlc":null,"dlc_name":null,"game":{"api_detail_url":"http:\/\/www.giantbomb.com\/api\/game\/3030-20499\/","id":20499,"name":"Too Human","site_detail_url":"http:\/\/www.giantbomb.com\/too-human\/3030-20499\/"},"publish_date":"2008-08-18 18:00:00","release":{"api_detail_url":"http:\/\/www.giantbomb.com\/api\/release\/3050-72427\/","id":72427,"name":"Too Human"},"reviewer":"Jeff","score":3,"site_detail_url":"http:\/\/www.giantbomb.com\/reviews\/too-human-review\/1900-45\/","platforms":null},"version":"0"}